DNA-2019/project-2023/distributed-store.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-13 Mon 08:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Gustavo Petri" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc6739bf">1. Simple distributed store system (aka Distributed File System)</a>
<ul>
<li><a href="#org7aa5410">1.1. Day 1</a>
<ul>
<li><a href="#org2ea8207">1.1.1. Part 1:</a></li>
<li><a href="#org469824f">1.1.2. Part 2:</a></li>
</ul>
</li>
<li><a href="#org75081ec">1.2. Day 2:</a>
<ul>
<li><a href="#org10117d7">1.2.1. Part 1:</a></li>
<li><a href="#org52f369e">1.2.2. Part 2:</a></li>
</ul>
</li>
<li><a href="#orga5b06d7">1.3. Day 3:</a>
<ul>
<li><a href="#org5b915ec">1.3.1. Part 1:</a></li>
<li><a href="#org0560522">1.3.2. Part 2:</a></li>
</ul>
</li>
<li><a href="#org18c1bf4">1.4. Day 4:</a>
<ul>
<li><a href="#org2f76497">1.4.1. Part 1:</a></li>
<li><a href="#org901bae0">1.4.2. Part 2:</a></li>
</ul>
</li>
<li><a href="#org4c463f4">1.5. Day 5:</a>
<ul>
<li><a href="#org15b4edb">1.5.1. Cloud</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc6739bf" class="outline-2">
<h2 id="orgc6739bf"><span class="section-number-2">1.</span> Simple distributed store system (aka Distributed File System)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7aa5410" class="outline-3">
<h3 id="org7aa5410"><span class="section-number-3">1.1.</span> Day 1</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2ea8207" class="outline-4">
<h4 id="org2ea8207"><span class="section-number-4">1.1.1.</span> Part 1:</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Consider a simple store system with the following operations:
<ul class="org-ul">
<li>Store(key, value) // we can assume that keys and values are strings</li>
<li>Lookup(key)</li>
<li>Delete(key)</li>
</ul></li>
<li>Provide a very simple implementation of the system based on an Key-Value HashTable
<ul class="org-ul">
<li>Assume the user can issue these operations through the terminal</li>
<li>Assume this service is entirely to be maintained in-memory</li>
</ul></li>
<li>Question:
<ul class="org-ul">
<li>What happens when the user accidentally types an incorrect command?</li>
<li>What happens if the user accidentally types Ctrl-c?</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org469824f" class="outline-4">
<h4 id="org469824f"><span class="section-number-4">1.1.2.</span> Part 2:</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>To improve on our simplistic design above, we will imagine that the server and the user-terminal run in different process
<ul class="org-ul">
<li>Split the example above to
<ol class="org-ol">
<li>Implement the Key-value store on an independent actor</li>
<li>Implement the console reader on an independent actor</li>
</ol></li>
<li>Because these actors are still running on a single actor system, if the process is terminated, we still lose all data
<ul class="org-ul">
<li>Don't worry about this for now, we are growing the architecture</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org75081ec" class="outline-3">
<h3 id="org75081ec"><span class="section-number-3">1.2.</span> Day 2:</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org10117d7" class="outline-4">
<h4 id="org10117d7"><span class="section-number-4">1.2.1.</span> Part 1:</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>To improve further on the design from yesterday, we will re-implement the storage</li>
<li>We will implement a durable-actor which implements the key-value abstraction with an append-only file
<ul class="org-ul">
<li>When the user stores an element, we append the (key, value) pair at the end of the file</li>
<li>When the user deletes an element, we add a (key, deleted) marker at the end of the file</li>
<li>When the user looks up a key, we traverse the file back to front to find the first non-deleted value, if any</li>
</ul></li>
<li>What happens if our server crashes now?
<ul class="org-ul">
<li>Try crashing the server, and restarting it. Do we still have the objects?</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org52f369e" class="outline-4">
<h4 id="org52f369e"><span class="section-number-4">1.2.2.</span> Part 2:</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Consider the complexity of a lookup operation, what are the the best and works case complexities</li>
<li>As the file grows, the performance of traversing the whole log becomes a bottleneck
<ul class="org-ul">
<li>To improve performance, we will, alongside the file, keep an in-memory key-value store</li>
<li>Since the key-value store uses a lot of memory, we will implemented it in a different actor</li>
</ul></li>
<li>Consider the complexity of store and lookup operations with this new architecture</li>
<li>Consider the durability of the new architecture</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga5b06d7" class="outline-3">
<h3 id="orga5b06d7"><span class="section-number-3">1.3.</span> Day 3:</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org5b915ec" class="outline-4">
<h4 id="org5b915ec"><span class="section-number-4">1.3.1.</span> Part 1:</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>Suppose we have a lot of keys with large values, what bottlenecks can you imagine?
<ul class="org-ul">
<li>Propose some solutions to the problem, propose architectural changes to the actor system to implement these solutions</li>
<li>Simulate a slow centralized key-value store by adding a small delay before the system responds back</li>
</ul></li>
<li>Suppose we can have super-fast key-value stores, which can store at most 1000 keys
<ul class="org-ul">
<li>How can we use these actors to improve overall performance of our system?</li>
<li>Implement a caching actor
<ul class="org-ul">
<li>If we had N caching actors, what performance improvements can we implement?</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0560522" class="outline-4">
<h4 id="org0560522"><span class="section-number-4">1.3.2.</span> Part 2:</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Implement a client program, that makes a large number of random requests to the storage service assume keys are 1-1000 (or equivalent)
<ul class="org-ul">
<li>Populate the storage with values for keys from 1-500</li>
<li>Pick an operation at random from store, delete, and lookup
<ul class="org-ul">
<li>If the operation is a store or delete, make sure that the key picked is greater than 500</li>
<li>If the operation is a lookup pick the last key looked-up 50% of the time
<ul class="org-ul">
<li>If we have to look up a new key, bias the sampling towards the first 1-500</li>
</ul></li>
</ul></li>
</ul></li>
<li>Run the system against the version without the cache, and against the version with the cache
<ul class="org-ul">
<li>What do you observe? Average a number of runs of this randomized client</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org18c1bf4" class="outline-3">
<h3 id="org18c1bf4"><span class="section-number-3">1.4.</span> Day 4:</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org2f76497" class="outline-4">
<h4 id="org2f76497"><span class="section-number-4">1.4.1.</span> Part 1:</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>While the design above is promising we still have the problem that with a single actor system, an error on the part of the client can crash the whole system</li>
<li>To avoid this, make each of the actors (with the exception of caching actors) run on a separate actor system, and process
<ul class="org-ul">
<li>This involves:
<ol class="org-ol">
<li>The storage logging actor is a single process</li>
<li>The centralized key-value store is a single process</li>
<li>The cache actors run in their own process</li>
<li>The client (or console) runs on an individual process (doesn't need to be an actor)</li>
</ol></li>
<li>To implement this, you will need to set up a cluster, so be mindful of port configurations</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org901bae0" class="outline-4">
<h4 id="org901bae0"><span class="section-number-4">1.4.2.</span> Part 2:</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>Consider the failure cases for each of these components
<ul class="org-ul">
<li>What happens to the overall system if the component crashes</li>
<li>What actions are necessary to bring the system back to operation</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4c463f4" class="outline-3">
<h3 id="org4c463f4"><span class="section-number-3">1.5.</span> Day 5:</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org15b4edb" class="outline-4">
<h4 id="org15b4edb"><span class="section-number-4">1.5.1.</span> Cloud</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Run the system on an Elastic Cloud Service on EC2</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gustavo Petri</p>
<p class="date">Created: 2023-03-13 Mon 08:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>